app/Controllers/Auth.php

INSERT INTO `users` (`username`, `email`, `password`, `role`) VALUES ('adasdsadsa', 'ghoul112@gmail.com', '$2y$10$/hskccip/IXmizvXyh7nhORD71bFkYawu1j7e/z6F2Tg/h0jCz/Lu', 'user')
---
    public function register()
    {
        if ($this->request->getMethod() === 'post') {
            $userModel = new UserModel();

            $data = [
                'username' => $this->request->getPost('username'),
                'email'    => $this->request->getPost('email'),
                'password' => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
                'role'     => 'user'
            ];

            $userModel->insert($data);

SELECT *
FROM `users`
WHERE `email` = 'ghoul112@gmail.com'
 LIMIT 1
---
    public function login()
    {
        if ($this->request->getMethod() === 'post') {
            $userModel = new UserModel();
            $user = $userModel->where('email', $this->request->getPost('email'))->first();