app/Controllers/Home.php

SELECT *
FROM `materi`
WHERE `status` = 'approved'
ORDER BY `created_at` DESC
---
    public function index()
    {
        if (session()->get('logged_in')) {
            return redirect()->to('/home/dashboard');
        }

        $materiModel = new MateriModel();
        $materi = $materiModel
            ->where('status', 'approved')
            ->orderBy('created_at', 'DESC')
            ->limit(5)
            ->findAll();

SELECT *
FROM `materi`
WHERE `status` = 'approved'
ORDER BY `created_at` DESC
---
    public function dashboard()
    {

        $materiModel = new MateriModel();
        $materi = $materiModel
            ->where('status', 'approved')
            ->orderBy('created_at', 'DESC')
            ->limit(5)
            ->findAll();