app/Controllers/Komentar.php

    public function kirimKomentar()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('/login');
        }

        $isi = trim($this->request->getPost('isi'));

        if (strlen($isi) < 3) {
            return redirect()->back()->withInput()->with('error', 'Komentar minimal 3 karakter.');
        }

        $parentId = $this->request->getPost('parent_id');
        $parentId = ($parentId === '' || $parentId === null) ? null : (int)$parentId;

        $this->komentarModel->insert([
            'materi_id' => $this->request->getPost('materi_id'),
            'user_id'   => session()->get('user_id'),
            'parent_id' => $parentId,
            'isi'       => $isi,
        ]);
---
INSERT INTO `komentar` (`materi_id`, `user_id`, `parent_id`, `isi`, `created_at`, `updated_at`) VALUES ('10', '3', NULL, 'gambar apa ini ?', '2025-07-27 07:21:31', '2025-07-27 07:21:31')