app/Controllers/Materi.php

    public function detail($id)
    {
        $materiModel = new MateriModel();
        $komentarModel = new KomentarModel();
        $userModel = new UserModel();

        $materi = $materiModel
                    ->select('materi.*, users.username')
                    ->join('users', 'users.id = materi.user_id')
                    ->where('materi.id', $id)
                    ->first();
---
SELECT `materi`.*, `users`.`username`
FROM `materi`
JOIN `users` ON `users`.`id` = `materi`.`user_id`
WHERE `materi`.`id` = '10'
 LIMIT 1