app/Controllers/User.php

SELECT *
FROM `users`
WHERE `users`.`id` = '3'
SELECT *
FROM `materi`
WHERE `user_id` = '3'
---
    public function profil()
    {
        $userId = session('user_id');

        $userModel = new UserModel();
        $materiModel = new MateriModel();

        $user = $userModel->find($userId);
        $materiSaya = $materiModel->where('user_id', $userId)->findAll();