app/Models/KomentarModel.php

SELECT `komentar`.*, `users`.`username`
FROM `komentar`
JOIN `users` ON `users`.`id` = `komentar`.`user_id`
WHERE `materi_id` = '10'
ORDER BY `created_at` ASC
---
    public function getKomentarBertingkat($materiId)
    {
        $komentarFlat = $this->select('komentar.*, users.username')
                             ->join('users', 'users.id = komentar.user_id')
                             ->where('materi_id', $materiId)
                             ->orderBy('created_at', 'ASC')
                             ->findAll();